#+title: ogent Runbook
#+options: toc:2
#+property: header-args:sh :results output :exports both

A literate runbook for building, testing, and driving ogent. Every step is
an executable block: put point in a block and press =C-c C-c= to run it
(=:results= land right under the block). Blocks assume point is in this
file at the repo root, so =default-directory= is the project root.

All build automation funnels through the [[file:Makefile::61][Makefile]], which delegates to the
vendored [[file:makem.sh][makem.sh]]. On macOS the Makefile prepends Homebrew GNU coreutils
and gnu-getopt to =PATH= automatically (makem.sh needs them).

** Check the toolchain

Emacs 29+, git, and (on macOS) GNU coreutils must be available:

#+begin_src sh :results output
emacs --version | head -1
git --version
make --version | head -1
#+end_src

#+RESULTS:
: GNU Emacs 30.1
: git version 2.51.2
: GNU Make 3.81

** The demo notebook

=make demo= ([[file:Makefile::116][Makefile:116]]) opens [[file:sandbox/demo.org][sandbox/demo.org]] in =emacs -Q= — a
17-line guided fixture that walks the core workflow: headings tagged with
=:OGENT_ID:= properties, an =@handle= reference, and instructions to
launch the dispatcher.

#+begin_src sh :eval no
make demo
#+end_src

Peek at the fixture without launching Emacs — real captured output
(2026-06-10, this checkout):

#+begin_src sh :results output
head -8 sandbox/demo.org
#+end_src

#+RESULTS:
: * Ogent Demo Notebook
: :PROPERTIES:
: :OGENT_ID: demo-root
: :END:
: Walk through the core workflow:
: 1. Tag reusable sections with ids.
: 2. Reference handles like @prompts-library.
: 3. Hit C-c o p to launch the dispatcher.

